InformationRegisters/НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НастройкиПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СпособВыводаОстатковВПодборе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СпособВыводаОстатковВПодборе</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВТаблице</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отдельно</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/ФормаНастройкаПодбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Пользователь = Пользователи.ТекущийПользователь();
	СпособВыводаОстатков = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь,
		"СпособВыводаОстатков");
	СпособВыводаОстатков = ?(ЗначениеЗаполнено(СпособВыводаОстатков), СпособВыводаОстатков,
		Перечисления.СпособВыводаОстатковВПодборе.ВТаблице);

	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ПоказыватьОстатки",
		УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ПоказыватьОстатки"));
	СтруктураНастроек.Вставить("ПоказыватьЦены",
		УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ПоказыватьЦены"));
	СтруктураНастроек.Вставить("СпособВыводаОстатков", СпособВыводаОстатков);
	СтруктураНастроек.Вставить("ЗапоминатьТекущуюИерархию",
		УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь,
		"ЗапоминатьТекущуюИерархию"));
				
	// Если резервирование выключено, то нет смысла работать с переключателями резерва и свободными остатками
	ЗначениеКонстантыРезервированиеЗапасов = ПолучитьФункциональнуюОпцию("РезервированиеЗапасов");

	СтруктураНастроек.Вставить("ПоказыватьРезерв", ?(ЗначениеКонстантыРезервированиеЗапасов,
		УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ПоказыватьРезерв"),
		Ложь));

	СтруктураНастроек.Вставить("ПоказыватьСвободныйОстаток", ?(ЗначениеКонстантыРезервированиеЗапасов,
		УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь,
		"ПоказыватьСвободныйОстаток"), Ложь));

	Элементы.ПоказыватьРезерв.Доступность = ЗначениеКонстантыРезервированиеЗапасов;
	Элементы.ПоказыватьСвободныйОстаток.Доступность = ЗначениеКонстантыРезервированиеЗапасов;
	
	// Заполним значения
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураНастроек);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьДоступностьПереключателей(ПоказыватьОстатки Или ПоказыватьРезерв Или ПоказыватьСвободныйОстаток
		Или ПоказыватьЦены);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоказыватьОстаткиПриИзменении(Элемент)

	УстановитьДоступностьПереключателей(ПоказыватьОстатки Или ПоказыватьРезерв Или ПоказыватьСвободныйОстаток
		Или ПоказыватьЦены);

КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьРезервПриИзменении(Элемент)

	УстановитьДоступностьПереключателей(ПоказыватьОстатки Или ПоказыватьРезерв Или ПоказыватьСвободныйОстаток
		Или ПоказыватьЦены);

КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьСвободныйОстатокПриИзменении(Элемент)

	УстановитьДоступностьПереключателей(ПоказыватьОстатки Или ПоказыватьРезерв Или ПоказыватьСвободныйОстаток
		Или ПоказыватьЦены);

КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьЦеныПриИзменении(Элемент)

	УстановитьДоступностьПереключателей(ПоказыватьОстатки Или ПоказыватьРезерв Или ПоказыватьСвободныйОстаток
		Или ПоказыватьЦены);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ЗаписатьНастройкиОтчета();
	Результат = Новый Структура;
	Результат.Вставить("ПоказыватьОстатки", ПоказыватьОстатки);
	Результат.Вставить("ПоказыватьРезерв", ПоказыватьРезерв);
	Результат.Вставить("ПоказыватьСвободныйОстаток", ПоказыватьСвободныйОстаток);
	Результат.Вставить("ПоказыватьЦены", ПоказыватьЦены);
	Результат.Вставить("СпособВыводаОстатков", СпособВыводаОстатков);
	Результат.Вставить("ЗапоминатьТекущуюИерархию", ЗапоминатьТекущуюИерархию);
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура записывает настройки подбора в пользовательские настройки
&НаСервере
Процедура ЗаписатьНастройкиОтчета()

	РегистрыСведений.НастройкиПользователей.Установить(ПоказыватьОстатки, "ПоказыватьОстатки");
	РегистрыСведений.НастройкиПользователей.Установить(ПоказыватьРезерв, "ПоказыватьРезерв");
	РегистрыСведений.НастройкиПользователей.Установить(ПоказыватьСвободныйОстаток,
		"ПоказыватьСвободныйОстаток");
	РегистрыСведений.НастройкиПользователей.Установить(ПоказыватьЦены, "ПоказыватьЦены");
	РегистрыСведений.НастройкиПользователей.Установить(СпособВыводаОстатков, "СпособВыводаОстатков");
	РегистрыСведений.НастройкиПользователей.Установить(ЗапоминатьТекущуюИерархию,
		"ЗапоминатьТекущуюИерархию");

КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьПереключателей(ПризнакДоступности)

	Элементы.СпособВыводаОстатков.Доступность = ПризнакДоступности;

КонецПроцедуры

#КонецОбласти
